init.el
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-packages on non-linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; (use-package auto-package-update
;;   :custom
;;   (auto-package-update-interval 7) ;; interval to update in days
;;   (auto-package-update-prompt-before-update t)
;;   (auto-package-update-hide-results t) ;; hide updated packages, nil to show
;;   :config
;;   (auto-package-update-maybe) ;; will check wether it needs an update at startup time
;;   (auto-package-update-at-time "09:00"))

(use-package gcmh
  :config
  (gcmh-mode 1)
  (setq gcmh-cons-threshold 100000000))

(defvar clover/default-font-size 120)

(setq inhibit-startup-message t)

(scroll-bar-mode -1)	;Disable visible scrollbar
(tool-bar-mode -1)	;Disable the toolbar
(tooltip-mode -1)	;Disable tooltips
(set-fringe-mode 10)	;Give some breathing room

(menu-bar-mode -1)	;Disable the menu bar

(setq visual-line-mode t)

;; Set up the visible bell
(setq visible-bell t) 

;; Enable line numbers
(column-number-mode)
(global-display-line-numbers-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; INDENTATION (global defaults)
(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)
(electric-indent-mode 1)

;; AUTO PAIRS
(electric-pair-mode 1)

;; (add-hook 'nix-mode-hook (lambda () (setq tab-width 2)))

(set-face-attribute 'default nil :family "Fira Code" :height clover/default-font-size)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :family "Fira Code" :height 120)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :family "Cantarell" :height 100 :weight 'regular)

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package embrace)
(use-package evil-embrace
  :after evil
  :config
  (evil-embrace-enable-evil-surround-integration))

(use-package evil-commentary
  :after evil
  :config (evil-commentary-mode))

;; (unless (package-installed-p 'evil)
;;   (package-install 'evil))

;; (use-package evil-collection
;;   :ensure t
;;   :after evil
;;   :init
;;   (evil-collection-init))

;; ;; Enable Evil
;; (setq evil-want-keybinding nil)
;; (require 'evil)
;; (evil-mode 1)
;; (when (require 'evil-collection nil t)
;;   (evil-collection-init))

;; Makes "jk" quit insert mode
(defun my-jk ()
  (interactive)
  (let* ((initial-key ?j)
         (final-key ?k)
         (timeout 0.5)
         (event (read-event nil nil timeout)))
    (if event
        ;; timeout met
        (if (and (characterp event) (= event final-key))
            (evil-normal-state)
          (insert initial-key)
          (push event unread-command-events))
      ;; timeout exceeded
      (insert initial-key))))

(define-key evil-insert-state-map (kbd "j") 'my-jk)

(use-package doom-themes ;; counsel-load-theme
  :init (load-theme 'doom-tomorrow-night t)) ;; doom-peacock before

(use-package all-the-icons)

;; bar at the of the buffer
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

;; which key mini buffer
(require 'which-key)
(which-key-mode)

;; Ivy config ----
(use-package ivy
  :diminish 
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

;; Little description next to the command 
(require 'ivy-rich)
(ivy-rich-mode 1)
(setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)

;; replace some commands for better ones
(use-package counsel
  :bind (("C-M-j" . 'counsel-switch-buffer)
         ("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)))

(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

(use-package corfu
  :custom
  (corfu-cycle t) ;; Enable cycling for next and previous
  (corfu-preselect 'prompt)
  (corful-preselected 'directory) ;; Select first candidate, except for dirs
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode)
  :config
  (keymap-unset corfu-map "RET")) ;; Unbind RET completely

(setq corfu-auto t
      corfu-auto-prefix 1
      corfu-on-exact-match 'quit
      corfu-auto-delay 0.1
      corfu-preview-current 1
      corfu-popupinfo-delay '(0.0 . 0.2))

(use-package emacs
  :custom
  (tab-always-indent 'complete))

(with-eval-after-load 'corfu
  (define-key corfu-map (kbd "TAB") #'corfu-insert)
  (define-key corfu-map (kbd "<tab>") #'corfu-insert)
  (define-key corfu-map (kbd "RET") #'corfu-insert))

(add-hook 'python-ts-mode-hook
        (lambda ()
          (setq-local completion-at-point-functions
                      (list #'yasnippet-capf #'eglot-completion-at-point #'cape-file #'cape-dabbrev))))

(add-hook 'org-mode-hook
        (lambda ()
          (setq-local corfu-auto nil)))

;; (with-eval-after-load 'corfu
;;   (define-key corfu-map (kbd "TAB") #'corfu-insert)
;;   (define-key corfu-map (kbd "<tab>") #'corfu-insert))
