emacs.org
*** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document. This is really a matter of personal preference so you can remove the block below if you don’t like the behavior. 

#+begin_src emacs-lisp

  (defun clover/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . clover/org-mode-visual-fill))
  
#+end_src

** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you will need to setup =org-babel-load-languages= for each language you would like to use. [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][Here]] you can find all languages supported by =org-babel=

#+begin_src emacs-lisp

    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes)

   (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  ;; (add-to-list 'org-structure-template-alist '("py" . "src python")) 

#+end_src

** Auto-tangle Configuration Files

#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun clover/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.config/emacs/emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'clover/org-babel-tangle-config)))
  
#+end_src

#+begin_src emacs-lisp

(require 'ox-md)

  (defun org-to-readme ()
    "Export the current Org file to README.md."
    (interactive)
    (let ((output-file "README.md"))
      (org-export-to-file 'md output-file)
      (message "Exported to %s" output-file)))
  
#+end_src


* Development

** Languages

*** Tree-Sit
#+begin_src emacs-lisp

  ;; (setq treesit-language-source-alist
  ;;       '((bash "https://github.com/tree-sitter/tree-sitter-bash")
  ;;         (cmake "https://github.com/uyha/tree-sitter-cmake")
  ;;         (css "https://github.com/tree-sitter/tree-sitter-css")
  ;;         (elisp "https://github.com/Wilfred/tree-sitter-elisp")
  ;;         (go "https://github.com/tree-sitter/tree-sitter-go")
  ;;         (gomod "https://github.com/camdencheek/tree-sitter-go-mod")
  ;;         (dockerfile "https://github.com/camdencheek/tree-sitter-dockerfile")
  ;;         (html "https://github.com/tree-sitter/tree-sitter-html")
  ;;         (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
  ;;         (json "https://github.com/tree-sitter/tree-sitter-json")
  ;;         (make "https://github.com/alemuller/tree-sitter-make")
  ;;         (markdown "https://github.com/ikatyang/tree-sitter-markdown")
  ;;         (python "https://github.com/tree-sitter/tree-sitter-python")
  ;;         (toml "https://github.com/tree-sitter/tree-sitter-toml")
  ;;         (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
  ;;         (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
  ;;         ;; (nix "https://github.com/nix-community/tree-sitter-nix")
  ;;         (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

  (use-package treesit-auto
    :defer 2
    :config
    (setq treesit-auto-install t
          treesit-font-lock-level 4)
    (global-treesit-auto-mode)
    (treesit-auto-add-to-auto-mode-alist 'all))

  (setq lsp-mode nil)
  (fset 'lsp 'ignore)
  (fset 'lsp-deferred 'ignore)


#+end_src

*** Eglot

#+begin_src emacs-lisp

  (use-package eglot
    :ensure nil
    :hook ((rust-ts-mode . eglot-ensure)
           (go-ts-mode   . eglot-ensure)
           (nix-ts-mode  . eglot-ensure)
           (zig-ts-mode  . eglot-ensure)
           (python-ts-mode . eglot-ensure))
    :config
    (add-to-list 'eglot-server-programs '(zig-ts-mode . ("zls")))
    (add-to-list 'eglot-server-programs '(nix-ts-mode . ("nil")))
    ;; Optional: format on save for eglot buffers only
    (add-hook 'eglot-managed-mode-hook
              (lambda ()
                (add-hook 'before-save-hook #'eglot-format-buffer nil t))))

  (with-eval-after-load 'eglot
    (setq completion-category-overrides
          '((eglot (styles orderless))
            (eglot-capf (styles orderless)))))


  (use-package eldoc-box
    :config
    (require 'eldoc-box))

  (defvar clover/indent-width 2
    "Indentation width used everywhere.")

#+end_src

*** HTML
#+begin_src emacs-lisp

  (use-package tagedit
    :hook (html-mode . tagedit-mode)
    :config
    ;; optional but recommended
    (tagedit-add-paredit-like-keybindings)

    ;; experimental auto-insert/close behavior
    (tagedit-add-experimental-features))


#+end_src

*** Rust

**** Rustic
[[https://github.com/brotzeit/rustic][rustic]] is an extension of rust-mode which adds a number of useful features (see the its github readme) to it. Most of rustics features are bound to the =C-c C-c= prefix. You can use C-c C-c C-r to run the program via =cargo run=. You will be asked for parameters and can for example specify =--release= to run in release mode or   =--bin other-bin= to run the target named “other-bin” (instead of main.rs). To pass parameters to the executable itself use =-- --arg1 --arg2=. 

The shortcut =C-c C-c C-c= will run the test at point. Very handy to run inline tests and to not always have switch back-and-forth between a terminal and Emacs. =C-c C-p= opens a popup buffer Rustic provides even more helpful integration with cargo, e.g. =M-x rustic-cargo-add= will allow you to add dependencies to your projects =Cargo.toml=

If you would like to share a code snippet with others, =M-x rustic-playpen= will open your current buffer in https://play.rust-lang.org where you can run the Rust code online and get a shareable link.
 
Code formatting on save is enabled and will use rustfmt. To disable it set (setq rustic-format-on-save nil). You can still format a buffer on demand using =C-c C-c C-o=.

#+begin_src emacs-lisp

  ;; (use-package rustic
  ;;   :ensure
  ;;   :config
  ;;   ;; uncomment for less flashiness
  ;;   ;; (setq lsp-eldoc-hook nil)
  ;;   ;; (setq lsp-enable-symbol-highlighting nil)
  ;;   ;; (setq lsp-signature-auto-activate nil)

  ;;   ;; comment to disable rustfmt on save
  ;;                                         ;(setq rustic-format-on-save t)
  ;;   (setq rustic-format-trigger 'on-save))

  ;; (defun rustic-mode-auto-save-hook ()
  ;;   "Enable auto-saving in rustic-mode buffers."
  ;;   (when buffer-file-name
  ;;     (setq-local compilation-ask-about-save nil)))
  ;; (add-hook 'rustic-mode-hook 'rustic-mode-auto-save-hook)

  (setq-default rust-indent-offset 2)

#+end_src

*** Python

C-c C-c       python-shell-send-buffer
C-c C-d       python-describe-at-point
C-c C-f       python-eldoc-at-point
C-c C-j       imenu
C-c C-l       python-shell-send-file
C-c C-p       run-python
C-c C-r       python-shell-send-region
C-c C-s       python-shell-send-string
C-c C-t       Prefix Command
C-c C-v       python-check
C-c C-z       python-shell-switch-to-shell
C-c <     python-indent-shift-left
C-c >     python-indent-shift-right

C-c C-t c python-skeleton-class
C-c C-t d python-skeleton-def
C-c C-t f python-skeleton-for
C-c C-t i python-skeleton-if
C-c C-t m python-skeleton-import
C-c C-t t python-skeleton-try
C-c C-t w python-skeleton-while

#+begin_src emacs-lisp

  (setq-default python-indent-offset 2)

#+end_src


*** CSS

#+begin_src emacs-lisp

  (setq-default css-indent-offset 2)

#+end_src
*** Nix

#+begin_src emacs-lisp

  

#+end_src


** Projectile

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-project-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired))


  ;; C-c p f to find file, then M-o for more things to do
  (use-package counsel-projectile
    :config (counsel-projectile-mode))

#+end_src

** Magit

#+begin_src emacs-lisp

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

** Rainbow Delimeters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth. This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

