init.el

(defun clover/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . clover/org-mode-visual-fill))

(org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)

 (require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
;; (add-to-list 'org-structure-template-alist '("py" . "src python"))

;; Automatically tangle our Emacs.org config file when we save it
(defun clover/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.config/emacs/emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'clover/org-babel-tangle-config)))

(require 'ox-md)

  (defun org-to-readme ()
    "Export the current Org file to README.md."
    (interactive)
    (let ((output-file "README.md"))
      (org-export-to-file 'md output-file)
      (message "Exported to %s" output-file)))

;; (setq treesit-language-source-alist
;;       '((bash "https://github.com/tree-sitter/tree-sitter-bash")
;;         (cmake "https://github.com/uyha/tree-sitter-cmake")
;;         (css "https://github.com/tree-sitter/tree-sitter-css")
;;         (elisp "https://github.com/Wilfred/tree-sitter-elisp")
;;         (go "https://github.com/tree-sitter/tree-sitter-go")
;;         (gomod "https://github.com/camdencheek/tree-sitter-go-mod")
;;         (dockerfile "https://github.com/camdencheek/tree-sitter-dockerfile")
;;         (html "https://github.com/tree-sitter/tree-sitter-html")
;;         (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
;;         (json "https://github.com/tree-sitter/tree-sitter-json")
;;         (make "https://github.com/alemuller/tree-sitter-make")
;;         (markdown "https://github.com/ikatyang/tree-sitter-markdown")
;;         (python "https://github.com/tree-sitter/tree-sitter-python")
;;         (toml "https://github.com/tree-sitter/tree-sitter-toml")
;;         (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
;;         (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
;;         ;; (nix "https://github.com/nix-community/tree-sitter-nix")
;;         (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

(use-package treesit-auto
  :defer 2
  :config
  (setq treesit-auto-install t
        treesit-font-lock-level 4)
  (global-treesit-auto-mode)
  (treesit-auto-add-to-auto-mode-alist 'all))

(setq lsp-mode nil)
(fset 'lsp 'ignore)
(fset 'lsp-deferred 'ignore)

(use-package eglot
  :ensure nil
  :hook ((rust-ts-mode . eglot-ensure)
         (go-ts-mode   . eglot-ensure)
         (nix-ts-mode  . eglot-ensure)
         (zig-ts-mode  . eglot-ensure)
         (python-ts-mode . eglot-ensure))
  :config
  (add-to-list 'eglot-server-programs '(zig-ts-mode . ("zls")))
  (add-to-list 'eglot-server-programs '(nix-ts-mode . ("nil")))
  ;; Optional: format on save for eglot buffers only
  (add-hook 'eglot-managed-mode-hook
            (lambda ()
              (add-hook 'before-save-hook #'eglot-format-buffer nil t))))

(with-eval-after-load 'eglot
  (setq completion-category-overrides
        '((eglot (styles orderless))
          (eglot-capf (styles orderless)))))


(use-package eldoc-box
  :config
  (require 'eldoc-box))

(defvar clover/indent-width 2
  "Indentation width used everywhere.")

(use-package tagedit
  :hook (html-mode . tagedit-mode)
  :config
  ;; optional but recommended
  (tagedit-add-paredit-like-keybindings)

  ;; experimental auto-insert/close behavior
  (tagedit-add-experimental-features))

;; (use-package rustic
;;   :ensure
;;   :config
;;   ;; uncomment for less flashiness
;;   ;; (setq lsp-eldoc-hook nil)
;;   ;; (setq lsp-enable-symbol-highlighting nil)
;;   ;; (setq lsp-signature-auto-activate nil)

;;   ;; comment to disable rustfmt on save
;;                                         ;(setq rustic-format-on-save t)
;;   (setq rustic-format-trigger 'on-save))

;; (defun rustic-mode-auto-save-hook ()
;;   "Enable auto-saving in rustic-mode buffers."
;;   (when buffer-file-name
;;     (setq-local compilation-ask-about-save nil)))
;; (add-hook 'rustic-mode-hook 'rustic-mode-auto-save-hook)

(setq-default rust-indent-offset 2)

(setq-default python-indent-offset 2)

(setq-default css-indent-offset 2)



(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Projects/Code")
    (setq projectile-project-search-path '("~/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))


;; C-c p f to find file, then M-o for more things to do
(use-package counsel-projectile
  :config (counsel-projectile-mode))

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
